[
  {"question": "Do you prioritize fitness and exercise in your daily routine?", "dimension": "DL"},
  {"question": "Is exploring new culinary experiences an essential part of your life?", "dimension": "DL"},
  {"question": "Do you find relaxation in a bustling city more than in nature?", "dimension": "DL"},
  {"question": "Is a structured daily plan more comforting to you than spontaneity?", "dimension": "DL"},
  {"question": "Would you rather spend your evenings socializing than having quiet time?", "dimension": "DL"},
  {"question": "Do you believe shared hobbies are crucial for a successful relationship?", "dimension": "RD"},
  {"question": "In a relationship, is having individual space more important than constant togetherness?", "dimension": "RD"},
  {"question": "Do you think managing finances together strengthens a relationship?", "dimension": "RD"},
  {"question": "Is it essential to resolve disagreements on the same day they occur?", "dimension": "RD"},
  {"question": "Do you value deep, intellectual conversations over casual chit-chat?", "dimension": "RD"},
  {"question": "Is starting a family in the near future a priority for you?", "dimension": "FG"},
  {"question": "Do you envision a life that's more centered around home than career?", "dimension": "FG"},
  {"question": "Would you relocate for love if it meant leaving your job or career?", "dimension": "FG"},
  {"question": "Is owning a home more appealing to you than the flexibility of renting?", "dimension": "FG"},
  {"question": "Do you see yourself settling in one place rather than moving around?", "dimension": "FG"},
  {"question": "Do you consider yourself more traditional than progressive in relationships?", "dimension": "PVB"},
  {"question": "Is it important for your partner to share your political or religious beliefs?", "dimension": "PVB"},
  {"question": "Do you think acts of service are more expressive of love than words?", "dimension": "PVB"},
  {"question": "Is maintaining a long-term friendship before dating an essential foundation?", "dimension": "PVB"},
  {"question": "Do you believe that true love involves sacrifices and compromises?", "dimension": "PVB"}
]